In [5]:
import pandas as pd                      # Dataframe operations
import numpy as np                       # Math operations
import matplotlib.pyplot as plt          # Plotting
import seaborn as sns

In [7]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df['Age']=[20,22,24]
df['City']=['Hyderabad','Bangalore','Pune']
df

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [5]:
df.drop(2)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore

In [7]:
df.drop(2,axis=0)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore

In [9]:
df.drop(index=2)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore

In [11]:
df.drop([1,2])

    Names  Age       City
0  Ramesh   20  Hyderabad

In [15]:
df.drop([1,2],axis=0)

    Names  Age       City
0  Ramesh   20  Hyderabad

In [17]:
df.drop(index=[1,2])

    Names  Age       City
0  Ramesh   20  Hyderabad

In [19]:
df

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [21]:
df.drop('City',axis=1)

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

In [23]:
df.drop(['Names','City'],axis=1)

   Age
0   20
1   22
2   24

In [25]:
df.drop(columns='City')

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

In [27]:
df.drop(columns=['Names','City'])

   Age
0   20
1   22
2   24

**Step-7: Rename the Columns and Index**

 df.rename()

- mapper: 'Renamer | None' = None,
- index: 'Renamer | None' = None,
- columns: 'Renamer | None' = None,
- axis: 'Axis | None' = None,
- inplace: 'bool' = False,

**mapper means dictionary**

In [33]:
df.columns
dict1={'City':'city'}
df.rename(dict1)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [35]:
df.rename(dict1,axis=1)

    Names  Age       city
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [37]:
df.rename(columns=dict1)

    Names  Age       city
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [39]:
df.index
dict1={2:'b'}
df.rename(dict1)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
b  Satish   24       Pune

In [41]:
df.rename(index=dict1)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
b  Satish   24       Pune

In [43]:
df.columns=['A','B','C']

In [45]:
df

        A   B          C
0  Ramesh  20  Hyderabad
1  Suresh  22  Bangalore
2  Satish  24       Pune

In [47]:
df.index=['I','II','III']
df

          A   B          C
I    Ramesh  20  Hyderabad
II   Suresh  22  Bangalore
III  Satish  24       Pune

In [49]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [51]:
df.columns=['Names','Age','City']
df.index=[0,1,2]
df

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

**Step-8:Append the Rows**

- We need to us **loc**

- df.loc[<row numbers>,<column names>]

     - Example: df.loc[2,'City']

- Multiple rows from multiple columns

     - Example: df.loc[[1,2],['Names','City']]

- df.loc[<start:stop:step>,<column names>]

     - Example:df.loc[0:3,'City']

In [57]:
df.loc[2,'City']

'Pune'

In [61]:
 df.loc[[1,2],['Names','City']]

    Names       City
1  Suresh  Bangalore
2  Satish       Pune

In [63]:
df.loc[0:3,'City']

0    Hyderabad
1    Bangalore
2         Pune
Name: City, dtype: object

In [69]:
df

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [67]:
df.loc[2] #2nd index of all column

Names    Satish
Age          24
City       Pune
Name: 2, dtype: object

In [77]:
type(df.loc[2]) # Series

pandas.core.series.Series

In [71]:
df.loc[[2]] #2nd index of all column

    Names  Age  City
2  Satish   24  Pune

In [79]:
type(df.loc[[2]]) #[[<multiple square brackets>]] - Data Frame

pandas.core.frame.DataFrame

In [75]:
df.loc[[1,2]]

    Names  Age       City
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [81]:
type(df.loc[[1,2]])

pandas.core.frame.DataFrame

In [83]:
df.loc[0:3]

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [85]:
type(df.loc[0:3])

pandas.core.frame.DataFrame

In [87]:
df.loc[:]

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [89]:
type(df.loc[:])

pandas.core.frame.DataFrame

In [91]:
df.loc[2,'City']

'Pune'

In [93]:
type(df.loc[2,'City'])

str

In [95]:
df.loc[2,['City']]

City    Pune
Name: 2, dtype: object

In [97]:
type(df.loc[2,['City']])

pandas.core.series.Series

In [99]:
df.loc[[2],['City']]

   City
2  Pune

In [101]:
type(df.loc[[2],['City']])

pandas.core.frame.DataFrame

In [103]:
df.loc[[1,2],['Names','City']]

    Names       City
1  Suresh  Bangalore
2  Satish       Pune

In [105]:
type(df.loc[[1,2],['Names','City']])

pandas.core.frame.DataFrame

In [107]:
df.loc[:,'City']

0    Hyderabad
1    Bangalore
2         Pune
Name: City, dtype: object

In [109]:
type(df.loc[:,'City'])

pandas.core.series.Series

In [111]:
df.loc[:,['City']]

        City
0  Hyderabad
1  Bangalore
2       Pune

In [113]:
type(df.loc[:,['City']])

pandas.core.frame.DataFrame

**iloc**

In [ ]:
df.loc[<rows>,<column names>]
df.loc[<rows>,'City']
df.iloc[<rows>,2]

In [116]:
df.iloc[2]

Names    Satish
Age          24
City       Pune
Name: 2, dtype: object

In [118]:
type(df.iloc[2])

pandas.core.series.Series

In [120]:
df.iloc[[2]]

    Names  Age  City
2  Satish   24  Pune

In [122]:
type(df.iloc[[2]])

pandas.core.frame.DataFrame

In [124]:
df.iloc[[1,2]]

    Names  Age       City
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [126]:
type(df.iloc[[1,2]])

pandas.core.frame.DataFrame

In [128]:
df.iloc[0:3]

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [130]:
type(df.iloc[0:3])

pandas.core.frame.DataFrame

In [132]:
df.iloc[:]

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [134]:
type(df.iloc[:])

pandas.core.frame.DataFrame

In [136]:
df.iloc[2,2]

'Pune'

In [138]:
type(df.iloc[2,2])

str

In [140]:
df.iloc[2,[2]]

City    Pune
Name: 2, dtype: object

In [142]:
type(df.iloc[2,[2]])

pandas.core.series.Series

In [144]:
df.iloc[[2],[2]]

   City
2  Pune

In [146]:
type(df.iloc[[2],[2]])

pandas.core.frame.DataFrame

In [148]:
df.iloc[[1,2,],[0,2]]

    Names       City
1  Suresh  Bangalore
2  Satish       Pune

In [150]:
type(df.iloc[[1,2,],[0,2]])

pandas.core.frame.DataFrame

In [152]:
df.iloc[:,2] #df.iloc[0:3,2] #df.iloc[[0,1,2],2]

0    Hyderabad
1    Bangalore
2         Pune
Name: City, dtype: object

In [154]:
type(df.iloc[:,2])

pandas.core.series.Series

In [156]:
df.iloc[:,[2]] # df.iloc[0:3,[2]] #df.iloc[[0,1,2],[2]]

        City
0  Hyderabad
1  Bangalore
2       Pune

In [158]:
type(df.iloc[:,[2]])

pandas.core.frame.DataFrame

**Step-9: Save the DataFrame**

- Where i want to save
- on what name i want to save
- on what extension: .csv,.xlsx

In [161]:
df

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [166]:
path1=r"C:\Users\vamsh\Documents\DataFrames\employees.csv"
path2=r"employees.csv"
path3=r"C:\Users\vamsh\Documents\DataFrames\employees.xlsx"
path4=r"employees.xlsx"

df.to_csv(path1)
df.to_csv(path2)
df.to_excel(path3)
df.to_excel(path4)

**Step-10: Read the dataframe**

In [169]:
pd.read_csv(path1)

   Unnamed: 0   Names  Age       City
0           0  Ramesh   20  Hyderabad
1           1  Suresh   22  Bangalore
2           2  Satish   24       Pune

In [171]:
pd.read_csv(path2)

   Unnamed: 0   Names  Age       City
0           0  Ramesh   20  Hyderabad
1           1  Suresh   22  Bangalore
2           2  Satish   24       Pune

In [173]:
pd.read_excel(path3)

   Unnamed: 0   Names  Age       City
0           0  Ramesh   20  Hyderabad
1           1  Suresh   22  Bangalore
2           2  Satish   24       Pune

In [175]:
pd.read_excel(path4)

   Unnamed: 0   Names  Age       City
0           0  Ramesh   20  Hyderabad
1           1  Suresh   22  Bangalore
2           2  Satish   24       Pune

In [9]:
path1=r"C:\Users\vamsh\Documents\DataFrames\employees.csv"
path2=r"employees.csv"
path3=r"C:\Users\vamsh\Documents\DataFrames\employees.xlsx"
path4=r"employees.xlsx"

df.to_csv(path1,index=False)
df.to_csv(path2,index=False)
df.to_excel(path3,index=False)
df.to_excel(path4,index=False)

In [11]:
pd.read_csv(path1)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [13]:
pd.read_csv(path2)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [183]:
pd.read_excel(path3)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune

In [15]:
pd.read_excel(path4)

    Names  Age       City
0  Ramesh   20  Hyderabad
1  Suresh   22  Bangalore
2  Satish   24       Pune